# Avaliação CONSISTE (XTR)

Desenvolver codigo, bem comentado para que cada paço esteja apresentável a qualquer pessoa inclusive que não está habituado a liguagem PYTHON e acompanhar a lógica envolvida

Primeiro Passo: Importar Livraria Pandas (permite trabalhar com menos codigos e mais produtividade)

In [1]:
import pandas as pd

Segundo Passo: Carregar os dados do CSV (arquivo, separador usado, codigo usado, trocando separador de casa decimal)

In [2]:
df = pd.read_csv('dataset.csv', sep=';', encoding='latin1' ,decimal=',')

Terceiro Passo: Verificar se os dados foram carregados (df.head() - tras os 5 primeiras linhas como amostra)

In [3]:
df.head()

  Primeiro Nome         Sobrenomes  Peso (kg)  Altura (m)
0        felipe      neves da hora      70.60        1.69
1      sandro              barbosa      90.50        1.73
2        maycon  da silva ferreira     100.01        1.82
3   jeferson              Oliveira      80.04        1.75
4        manuel     gomes   vieira      63.05        1.80

Quarto Passo: Atribuindo as colunas o Método aplicado upper()

In [4]:
df['Primeiro Nome'] = df['Primeiro Nome'].str.upper()
df['Sobrenomes'] = df['Sobrenomes'].str.upper()

Quinto Passo: Testando o resultado

In [5]:
df.head()

  Primeiro Nome         Sobrenomes  Peso (kg)  Altura (m)
0        FELIPE      NEVES DA HORA      70.60        1.69
1      SANDRO              BARBOSA      90.50        1.73
2        MAYCON  DA SILVA FERREIRA     100.01        1.82
3   JEFERSON              OLIVEIRA      80.04        1.75
4        MANUEL     GOMES   VIEIRA      63.05        1.80

Sexto Passo: Juntar as colunas Primeiro nome + Sobrenomes e criar uma nova coluna NomSob

In [6]:
df['NomSob']= df['Primeiro Nome'] +' '+ df['Sobrenomes']

In [7]:
df.head()

,Primeiro Nome,Sobrenomes,Peso (kg),Altura (m),NomSob
0,FELIPE,NEVES DA HORA,70.60,1.69,FELIPE NEVES DA HORA
1,SANDRO,BARBOSA,90.50,1.73,SANDRO BARBOSA
2,MAYCON,DA SILVA FERREIRA,100.01,1.82,MAYCON DA SILVA FERREIRA
3,JEFERSON,OLIVEIRA,80.04,1.75,JEFERSON OLIVEIRA
4,MANUEL,GOMES VIEIRA,63.05,1.80,MANUEL GOMES VIEIRA

Sétimo Passo: Criar coluna com IMC de cada linha e colocar todos os numeros com 2 casas decimais

In [8]:
df['IMC'] = df['Peso (kg)']/(df['Altura (m)']*df['Altura (m)'])

In [9]:
df['IMC'] = round(df['IMC'],2)

Poderia usar tb: "pd.set_option('display.precision', 2)" - pra colocar toda a DataFrame no mesmo padrão de duas casas decimais

Oitavo Passo: Testando o resultado

In [10]:
df.head()

,Primeiro Nome,Sobrenomes,Peso (kg),Altura (m),NomSob,IMC
0,FELIPE,NEVES DA HORA,70.60,1.69,FELIPE NEVES DA HORA,24.72
1,SANDRO,BARBOSA,90.50,1.73,SANDRO BARBOSA,30.24
2,MAYCON,DA SILVA FERREIRA,100.01,1.82,MAYCON DA SILVA FERREIRA,30.19
3,JEFERSON,OLIVEIRA,80.04,1.75,JEFERSON OLIVEIRA,26.14
4,MANUEL,GOMES VIEIRA,63.05,1.80,MANUEL GOMES VIEIRA,19.46

Nono Passo: Juntando duas colunas Nome e IMC e verificando o resultado

In [11]:
df['Solução']= df['NomSob'] +' '+ df['IMC'].astype(str)
df.head()

,Primeiro Nome,Sobrenomes,Peso (kg),Altura (m),NomSob,IMC,Solução
0,FELIPE,NEVES DA HORA,70.60,1.69,FELIPE NEVES DA HORA,24.72,FELIPE NEVES DA HORA 24.72
1,SANDRO,BARBOSA,90.50,1.73,SANDRO BARBOSA,30.24,SANDRO BARBOSA 30.24
2,MAYCON,DA SILVA FERREIRA,100.01,1.82,MAYCON DA SILVA FERREIRA,30.19,MAYCON DA SILVA FERREIRA 30.19
3,JEFERSON,OLIVEIRA,80.04,1.75,JEFERSON OLIVEIRA,26.14,JEFERSON OLIVEIRA 26.14
4,MANUEL,GOMES VIEIRA,63.05,1.80,MANUEL GOMES VIEIRA,19.46,MANUEL GOMES VIEIRA 19.46

Décimo Passo: Selecionando apenas a ultima coluna

In [12]:
dfinal = df.iloc[:,[6]]
dfinal.head(100)

                                            Solução
0                        FELIPE NEVES DA HORA 24.72
1                            SANDRO   BARBOSA 30.24
2                    MAYCON DA SILVA FERREIRA 30.19
3                       JEFERSON     OLIVEIRA 26.14
4                       MANUEL GOMES   VIEIRA 19.46
..                                              ...
94                            LUNA LUNARA LUA 20.23
95                                 HULK  JOSE 24.65
96                              MARIA   GOMES 23.85
97                               PAULO  ROCHA 24.52
98  LUANE                  SANTANA   TEIXEIRA 22.57

[99 rows x 1 columns]

Último Passo: Exportar para CSV

In [13]:
dfinal.to_csv("C:\\Users\\dsant\\Downloads\\Python Scripts\\XTR\\DataSetIcm.ipynb", index=False)